# CutBackgroundPatternId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings..::..CutBackgroundPatternId Property
OverrideGraphicSettings Class See Also
---
The ElementId of the cut face background fill pattern override. A value of InvalidElementId means no override is set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public ElementId CutBackgroundPatternId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CutBackgroundPatternId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ CutBackgroundPatternId {
	ElementId^ get ();
}
```

# See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace